chapters/version-control.org
# -*- org-link-file-path-type: relative; -*-
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Version Control
#+date: <2023-02-03 Fri>
#+author: Britt Anderson
#+email: britt@uwaterloo.ca
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.2 (Org mode 9.6-pre)
#+bibliography: /home/britt/gitRepos/Intro2Computing4Psychology/chapters/i2c4p.bib
#+cite_export: csl assets/chicago-note-bibliography-16th-edition.csl

* Version Control
This refers to a system of saving your work and recording what changes were made when. This allows you to revert (undo) individual changes you have made. You can think of a branching tree where each change marks a new sprig. You can prune some branches and leave others alone. The values of version control are the capability to undo, but also to explore since you can try out new changes that are easy to erase and start over. It also allows easy sharing and collaboration since each co-author can commit changes to the common document. Since you work locally you can choose to accept or reject others' changes into your version. All these capacities support research. You have a record of what you did when. You can easily update work as required while keeping thorough records. You can share and collaborate. And thus your work is reproducible by others. Developed in the software community the tools of version control are widely applicable to data management and co-authoring scientific reports. In this chapter you will learn to use one common version control software, [[https://git-scm.com/][git]], one social coding repository based on git, [[https://github.com][github]], and some of the basic terminology of version control.

* Summary of Steps
  1. Create a Github Account. 
  2. Read the "Hello World" Github guide. 
  3. Navigate to the [[https://github.com/brittAnderson/Intro2Computing4Psychology][course repository]].
  4. /Fork/ both the course repository and the [[https://github.com/brittAnderson/psych363Practice][practice repository]] for the course.
  5. Generate a screen shot of your github home page after you have forked the course repositories. 
* A Github Account
#+begin_export html
<iframe src="https://player.vimeo.com/video/450563119?h=4cb2ec8cb5" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/450563119">Bb1 : Introduction to Github (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export

Science is collaborative and iterative. Computing projects, whether for industry or research, are usually too big for one person. Therefore, we benefit when there are tools to facilitate revision, reversion, recording, and sharing. [[https://github.com][Github]] is a large social coding platform with high visibility. While there are other similar platforms (e.g, [[https://bitbucket.org/product][Bitbucket,]] or [[https://gitlab.com/explore][Gitlab]]) Github is convenient for our educational goals. While you do *not* need a Github account to use ~git~, the version control software, ~git~ is used to manage your github projects. Therefore, you first need to create an account to use Github.
** Get your id   
    This is a straightfoward process. Navigate to [[https://github.com][Github]] and complete the sign up process on the home page. You should use whatever email address is convenient, and you can chose whatever username is available, but think for a moment. If you are successful in this course at improving your computing skills the Github platform is something you may want to use professionally in the future; pick a username that won't embarass you later.
** Sign in to your user account
   You should see a blank page with a random geometric avatar and no activity or respositories. 
* Look at the Github Guides
#+begin_export html
<iframe src="https://player.vimeo.com/video/450563176?h=438a094373" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/450563176">Bb2 : Intro to Github Screencast (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export
   The [[https://guides.github.com/][Github Guides]] will provide you with short introductions to the git terminology, the Github workflow, and how to create your first repository.
** Read the Hello World guide and create your first repository.
   The [[https://guides.github.com/activities/hello-world/][hello world]] guide will walk you through creating a repository. Even if you delete after creation go through these steps to learn what a repository is. 
* Navigate to my Github respositories and Fork the Course Repository and Practice Repository
My respositories are at: [[https://github.com/brittAnderson?tab=repositories][Britt's Repos]]
** What is a "Fork"?
    There is short github guide on the notion of a [[https://guides.github.com/activities/forking/][fork]]. 
