book/version-control.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-03 Fri 05:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Version Control</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Version Control</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3b98d70">1. Version Control</a></li>
<li><a href="#orgb75d3de">2. Summary of Steps</a></li>
<li><a href="#org89424a5">3. A Github Account</a>
<ul>
<li><a href="#org910683d">3.1. Get your id</a></li>
<li><a href="#orgc6fc165">3.2. Sign in to your user account</a></li>
</ul>
</li>
<li><a href="#orgdd32cfd">4. Look at the Github Guides</a>
<ul>
<li><a href="#orgb3be90e">4.1. Read the Hello World guide and create your first repository.</a></li>
</ul>
</li>
<li><a href="#orgdae8398">5. Navigate to my Github respositories and Fork the Course Repository and Practice Repository</a>
<ul>
<li><a href="#orge9e1800">5.1. What is a "Fork"?</a></li>
<li><a href="#org68e93d2">5.2. Fork the main course repository</a></li>
<li><a href="#orgc9ad2f9">5.3. Fork the course practice respository</a></li>
</ul>
</li>
<li><a href="#orgdb16511">6. Complete the github id assessment</a>
<ul>
<li><a href="#org9201754">6.1. Task</a></li>
</ul>
</li>
<li><a href="#org161192b">7. More about Git, Github and Forking Repositories</a></li>
<li><a href="#org6662365">8. Goal</a>
<ul>
<li><a href="#org97ae14a">8.1. Overview</a></li>
</ul>
</li>
<li><a href="#orgc23bc04">9. Not all repositories are git repositories</a>
<ul>
<li><a href="#orge51ee72">9.1. There are many other version control options and many other places to host them.</a>
<ul>
<li><a href="#orgeb3a55f">9.1.1. Other version control system</a></li>
<li><a href="#orgc34b5fa">9.1.2. Other Repositories</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org08140d1">10. Git and Linux</a></li>
<li><a href="#orgbdee249">11. But first &#x2026;</a></li>
<li><a href="#orgb0ed422">12. Git in Pictures</a></li>
<li><a href="#org0af0de5">13. Terms</a></li>
<li><a href="#org618cab4">14. Using <b>Git</b> in Linux</a>
<ul>
<li><a href="#orgfd1fe6f">14.1. Making your first repository (aka "repo") on your laptop.</a></li>
<li><a href="#orgb0c6176">14.2. Cloning a Course Repo</a>
<ul>
<li><a href="#org693afa8">14.2.1. Magit</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb239b23">15. Git Pull Request and Issues Assessment</a>
<ul>
<li><a href="#orgba59b45">15.1. Task</a></li>
<li><a href="#org0a56151">15.2. Comment</a></li>
<li><a href="#org8a3cb2d">15.3. Steps</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3b98d70" class="outline-2">
<h2 id="org3b98d70"><span class="section-number-2">1.</span> Version Control</h2>
<div class="outline-text-2" id="text-1">
<p>
This refers to a system of saving your work and recording what changes were made when. This allows you to revert (undo) individual changes you have made. You can think of a branching tree where each change marks a new sprig. You can prune some branches and leave others alone. The values of version control are the capability to undo, but also to explore since you can try out new changes that are easy to erase and start over. It also allows easy sharing and collaboration since each co-author can commit changes to the common document. Since you work locally you can choose to accept or reject others' changes into your version. All these capacities support research. You have a record of what you did when. You can easily update work as required while keeping thorough records. You can share and collaborate. And thus your work is reproducible by others. Developed in the software community the tools of version control are widely applicable to data management and co-authoring scientific reports. In this chapter you will learn to use one common version control software, <a href="https://git-scm.com/">git</a>, one social coding repository based on git, <a href="https://github.com">github</a>, and some of the basic terminology of version control.
</p>
</div>
</div>

<div id="outline-container-orgb75d3de" class="outline-2">
<h2 id="orgb75d3de"><span class="section-number-2">2.</span> Summary of Steps</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Create a Github Account.</li>
<li>Read the "Hello World" Github guide.</li>
<li>Navigate to the <a href="https://github.com/brittAnderson/Intro2Computing4Psychology">course repository</a>.</li>
<li><i>Fork</i> both the course repository and the <a href="https://github.com/brittAnderson/psych363Practice">practice repository</a> for the course.</li>
<li>Generate a screen shot of your github home page after you have forked the course repositories.</li>
</ol>
</div>
</div>
<div id="outline-container-org89424a5" class="outline-2">
<h2 id="org89424a5"><span class="section-number-2">3.</span> A Github Account</h2>
<div class="outline-text-2" id="text-3">
<iframe src="https://player.vimeo.com/video/450563119?h=4cb2ec8cb5" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/450563119">Bb1 : Introduction to Github (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>

<p>
Science is collaborative and iterative. Computing projects, whether for industry or research, are usually too big for one person. Therefore, we benefit when there are tools to facilitate revision, reversion, recording, and sharing. <a href="https://github.com">Github</a> is a large social coding platform with high visibility. While there are other similar platforms (e.g, <a href="https://bitbucket.org/product">Bitbucket,</a> or <a href="https://gitlab.com/explore">Gitlab</a>) Github is convenient for our educational goals. While you do <b>not</b> need a Github account to use <code>git</code>, the version control software, <code>git</code> is used to manage your github projects. Therefore, you first need to create an account to use Github.
</p>
</div>
<div id="outline-container-org910683d" class="outline-3">
<h3 id="org910683d"><span class="section-number-3">3.1.</span> Get your id</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is a straightfoward process. Navigate to <a href="https://github.com">Github</a> and complete the sign up process on the home page. You should use whatever email address is convenient, and you can chose whatever username is available, but think for a moment. If you are successful in this course at improving your computing skills the Github platform is something you may want to use professionally in the future; pick a username that won't embarass you later.
</p>
</div>
</div>
<div id="outline-container-orgc6fc165" class="outline-3">
<h3 id="orgc6fc165"><span class="section-number-3">3.2.</span> Sign in to your user account</h3>
<div class="outline-text-3" id="text-3-2">
<p>
You should see a blank page with a random geometric avatar and no activity or respositories. 
</p>
</div>
</div>
</div>
<div id="outline-container-orgdd32cfd" class="outline-2">
<h2 id="orgdd32cfd"><span class="section-number-2">4.</span> Look at the Github Guides</h2>
<div class="outline-text-2" id="text-4">
<iframe src="https://player.vimeo.com/video/450563176?h=438a094373" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/450563176">Bb2 : Intro to Github Screencast (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>
The <a href="https://guides.github.com/">Github Guides</a> will provide you with short introductions to the git terminology, the Github workflow, and how to create your first repository.
</p>
</div>
<div id="outline-container-orgb3be90e" class="outline-3">
<h3 id="orgb3be90e"><span class="section-number-3">4.1.</span> Read the Hello World guide and create your first repository.</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The <a href="https://guides.github.com/activities/hello-world/">hello world</a> guide will walk you through creating a repository. Even if you delete after creation go through these steps to learn what a repository is. 
</p>
</div>
</div>
</div>
<div id="outline-container-orgdae8398" class="outline-2">
<h2 id="orgdae8398"><span class="section-number-2">5.</span> Navigate to my Github respositories and Fork the Course Repository and Practice Repository</h2>
<div class="outline-text-2" id="text-5">
<p>
My respositories are at: <a href="https://github.com/brittAnderson?tab=repositories">Britt's Repos</a>
</p>
</div>
<div id="outline-container-orge9e1800" class="outline-3">
<h3 id="orge9e1800"><span class="section-number-3">5.1.</span> What is a "Fork"?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
There is short github guide on the notion of a <a href="https://guides.github.com/activities/forking/">fork</a>. 
</p>
</div>
</div>
