chapters/version-control.org
** Fork the main course repository
   When you fork the course repository you will enable /cloning/ (to be covered later) your own local version on your home computer or laptop. Your fork will also give you access to your own copies of all files that you can edit or add to without affecting my copies. Your fork (and subsequently your clone) will give you a way to add changes back to my copies (if I accept your /pull request/) and easily incorporate new changes that I make into your version. 
   The main course repository is here: https://github.com/brittAnderson/Intro2Computing4Psychology
   Note that there is a ~readme~ file on the landing page. This is created from the ~readme.org~ file that you can see in the list of code files right above. Open this up by clicking on it and make a local change to your version of the readme.org file. Maybe add a line that says this is your fork; something minor; and then ~commit~ that change. You should see the readme region change to reflect your change (you may have to refresh your browser). You will at this point have progressed through some of the core features of version control, but to practice some more ...
** Fork the course practice respository
   You can find that here: https://github.com/brittAnderson/psych363practice
* Complete the github id assessment
** Task
  1. Create a [[https://github.com/][github account]].
  2. *Fork* the two course related repositories.
     A. [[https://github.com/brittAnderson/Intro2Computing4Psychology][Intro2Computing4Psychology]]
     B. [[https://github.com/brittAnderson/psych363Practice][psych363Practice]]
  3. Submit a screen short of your github account with appropriate respositories created to the Dropbox on Learn.
* More about Git, Github and Forking Repositories
=git= is a program that allows you to do version control. /Github/ is one of the larger social coding platform: an online agora for sharing, finding, and collaborating. It uses =git= as its base version control program, but it does other things too. We will now delve more into the details of using git including command line controls. 
* Goal
** Overview
  In an [[file:githubIDBasics.org][earlier topic]] we learned some of the basics of learning git and using it with github. Here we will learn what /push/, /pull/, and /remotes/ are all about. 


#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349826?h=4cee6292e8&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fa : Intro to Version Ctrl - Git (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
#+end_export

* Not all repositories are git repositories

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349738?h=27f3a64ec9&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fb : Github Pull Req part 1 (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
#+end_export

** There are many other version control options and many other places to host them.
*** Other version control system
    1. [[https://www.mercurial-scm.org/][Mercurial]]
    2. [[http://darcs.net/][Darcs]]
    3. [[https://www.nongnu.org/cvs/][CVS]]
    4. [[https://subversion.apache.org/][Subversion]]
    Each has their own fans. CVS and Subversion are more legacy options, but you will see them. Darcs is more of an experiment than a broadly used system. Mercurial seems to be the cool kid, but doesn't have as much market share as git, but any one of them might be a good choice for you in the future. Main point: version contol is not only ~git~.
*** Other Repositories
    Github is a very popular place to host your publically accessible repository, but it is far from your only option.
    1. [[https://osf.io/][OSF.io]]
       For scientists OSF.io seeks to make itself a way to host scientific projects and their data. 
       Trivia question? Do I have any repositories on Osf.io?
    2. [[https://sourceforge.net/][Sourceforge]]
       An oldie, but still used.
    3. [[https://bitbucket.org/][Bitbucket]]
    4. Gitlab
       The university provides you with a gitlab account:  [[https://git.uwaterloo.ca]]
    Main point: github is *not* your only option

* Git and Linux
  If you want to see one big advantage to using Linux try installing a program to let you easily manage git repositories on Windows. Then when you get frustrated try the following on your Ubuntu installation:
  
  #+begin_src sh :eval never
  sudo apt install git
  #+end_src

* But first ...
  Git wants to know who you are and how to get in contact with you. The first time you want to use git from the terminal you will have to specify this with the following

  #+begin_src sh :eval never
    git config --global user.name "John Doe"
    git config --global user.email johndoe@example.com
  #+end_src
  Please don't actually use "John Doe". More on these configuration options can be found [[https://git-scm.com/book/en/v2/Getting-Started-First-Time-Git-Setup][here]].

* Git in Pictures
  A few helpful illustrations to the distinction of clones, forks, pull, push, and pull request can be found [[https://www.toolsqa.com/git/difference-between-git-clone-and-git-fork/][here]].

