book/version-control.html
<div id="outline-container-org68e93d2" class="outline-3">
<h3 id="org68e93d2"><span class="section-number-3">5.2.</span> Fork the main course repository</h3>
<div class="outline-text-3" id="text-5-2">
<p>
When you fork the course repository you will enable <i>cloning</i> (to be covered later) your own local version on your home computer or laptop. Your fork will also give you access to your own copies of all files that you can edit or add to without affecting my copies. Your fork (and subsequently your clone) will give you a way to add changes back to my copies (if I accept your <i>pull request</i>) and easily incorporate new changes that I make into your version. 
The main course repository is here: <a href="https://github.com/brittAnderson/Intro2Computing4Psychology">https://github.com/brittAnderson/Intro2Computing4Psychology</a>
Note that there is a <code>readme</code> file on the landing page. This is created from the <code>readme.org</code> file that you can see in the list of code files right above. Open this up by clicking on it and make a local change to your version of the readme.org file. Maybe add a line that says this is your fork; something minor; and then <code>commit</code> that change. You should see the readme region change to reflect your change (you may have to refresh your browser). You will at this point have progressed through some of the core features of version control, but to practice some more &#x2026;
</p>
</div>
</div>
<div id="outline-container-orgc9ad2f9" class="outline-3">
<h3 id="orgc9ad2f9"><span class="section-number-3">5.3.</span> Fork the course practice respository</h3>
<div class="outline-text-3" id="text-5-3">
<p>
You can find that here: <a href="https://github.com/brittAnderson/psych363practice">https://github.com/brittAnderson/psych363practice</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgdb16511" class="outline-2">
<h2 id="orgdb16511"><span class="section-number-2">6.</span> Complete the github id assessment</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9201754" class="outline-3">
<h3 id="org9201754"><span class="section-number-3">6.1.</span> Task</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>Create a <a href="https://github.com/">github account</a>.</li>
<li><b>Fork</b> the two course related repositories.
<ol class="org-ol">
<li><a href="https://github.com/brittAnderson/Intro2Computing4Psychology">Intro2Computing4Psychology</a></li>
<li><a href="https://github.com/brittAnderson/psych363Practice">psych363Practice</a></li>
</ol></li>
<li>Submit a screen short of your github account with appropriate respositories created to the Dropbox on Learn.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org161192b" class="outline-2">
<h2 id="org161192b"><span class="section-number-2">7.</span> More about Git, Github and Forking Repositories</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>git</code> is a program that allows you to do version control. <i>Github</i> is one of the larger social coding platform: an online agora for sharing, finding, and collaborating. It uses <code>git</code> as its base version control program, but it does other things too. We will now delve more into the details of using git including command line controls. 
</p>
</div>
</div>
<div id="outline-container-org6662365" class="outline-2">
<h2 id="org6662365"><span class="section-number-2">8.</span> Goal</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org97ae14a" class="outline-3">
<h3 id="org97ae14a"><span class="section-number-3">8.1.</span> Overview</h3>
<div class="outline-text-3" id="text-8-1">
<p>
In an <a href="githubIDBasics.html">earlier topic</a> we learned some of the basics of learning git and using it with github. Here we will learn what <i>push</i>, <i>pull</i>, and <i>remotes</i> are all about. 
</p>


<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349826?h=4cee6292e8&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fa : Intro to Version Ctrl - Git (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
</div>
</div>
</div>

<div id="outline-container-orgc23bc04" class="outline-2">
<h2 id="orgc23bc04"><span class="section-number-2">9.</span> Not all repositories are git repositories</h2>
<div class="outline-text-2" id="text-9">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349738?h=27f3a64ec9&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fb : Github Pull Req part 1 (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
</div>

<div id="outline-container-orge51ee72" class="outline-3">
<h3 id="orge51ee72"><span class="section-number-3">9.1.</span> There are many other version control options and many other places to host them.</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgeb3a55f" class="outline-4">
<h4 id="orgeb3a55f"><span class="section-number-4">9.1.1.</span> Other version control system</h4>
<div class="outline-text-4" id="text-9-1-1">
<ol class="org-ol">
<li><a href="https://www.mercurial-scm.org/">Mercurial</a></li>
<li><a href="http://darcs.net/">Darcs</a></li>
<li><a href="https://www.nongnu.org/cvs/">CVS</a></li>
<li><a href="https://subversion.apache.org/">Subversion</a></li>
</ol>
<p>
Each has their own fans. CVS and Subversion are more legacy options, but you will see them. Darcs is more of an experiment than a broadly used system. Mercurial seems to be the cool kid, but doesn't have as much market share as git, but any one of them might be a good choice for you in the future. Main point: version contol is not only <code>git</code>.
</p>
</div>
</div>
<div id="outline-container-orgc34b5fa" class="outline-4">
<h4 id="orgc34b5fa"><span class="section-number-4">9.1.2.</span> Other Repositories</h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
Github is a very popular place to host your publically accessible repository, but it is far from your only option.
</p>
<ol class="org-ol">
<li><a href="https://osf.io/">OSF.io</a>
For scientists OSF.io seeks to make itself a way to host scientific projects and their data. 
Trivia question? Do I have any repositories on Osf.io?</li>
<li><a href="https://sourceforge.net/">Sourceforge</a>
An oldie, but still used.</li>
<li><a href="https://bitbucket.org/">Bitbucket</a></li>
<li>Gitlab
The university provides you with a gitlab account:  <a href="https://git.uwaterloo.ca">https://git.uwaterloo.ca</a></li>
</ol>
<p>
Main point: github is <b>not</b> your only option
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org08140d1" class="outline-2">
<h2 id="org08140d1"><span class="section-number-2">10.</span> Git and Linux</h2>
<div class="outline-text-2" id="text-10">
<p>
If you want to see one big advantage to using Linux try installing a program to let you easily manage git repositories on Windows. Then when you get frustrated try the following on your Ubuntu installation:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo apt install git
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbdee249" class="outline-2">
<h2 id="orgbdee249"><span class="section-number-2">11.</span> But first &#x2026;</h2>
<div class="outline-text-2" id="text-11">
<p>
Git wants to know who you are and how to get in contact with you. The first time you want to use git from the terminal you will have to specify this with the following
</p>

<div class="org-src-container">
<pre class="src src-sh">git config --global user.name <span style="color: #8b2252;">"John Doe"</span>
git config --global user.email johndoe@example.com
</pre>
</div>
<p>
Please don't actually use "John Doe". More on these configuration options can be found <a href="https://git-scm.com/book/en/v2/Getting-Started-First-Time-Git-Setup">here</a>.
</p>
</div>
</div>

<div id="outline-container-orgb0ed422" class="outline-2">
<h2 id="orgb0ed422"><span class="section-number-2">12.</span> Git in Pictures</h2>
<div class="outline-text-2" id="text-12">
<p>
A few helpful illustrations to the distinction of clones, forks, pull, push, and pull request can be found <a href="https://www.toolsqa.com/git/difference-between-git-clone-and-git-fork/">here</a>.
</p>
</div>
</div>
