chapters/version-control.org
* Terms
  - Fork :: A copy of one github repository to another *github* repository.
  - Clone :: A copy of one *git* repository to another *git* repository. 
             The first repository might be hosted on github, but the second one, the /cloned/ one exists on a local machine. In your case this is probably your laptop.
  - Remote :: This is a repository that you are following. You will typically /pull/ from these, but your /push/ permissions may be limited depending on the distinctions between forks and clones, and whether you own the remote or someone else does. You can have more than one remote.
  - Pull :: the transfer of information and changes *from* one repository incorporated into another. This is how you get the new information from a remote transported to a local repository that you control.
  - Push :: this is the transfer of information *to* a repository you control (or have permissions to push to) from another repository that you control. This is often from your local laptop version to the hosted repository (your fork) on github. 
  - Pull Request :: When you have information or changes that you think would be helpful to a remote you do *not* have push permissions for then you can request that the owner of that repository pull in your changes. This is a formal process called a pull request. It is primarily a github concept and not a git concept.
  - Branch :: within a repository the development of the code may be proceeding in a few different directions at the same time. The principal production branch is conventionally called *master*. And the principal repository that is the main, shared one is called *origin*. We will not be working with branches in our course, but those terms do show up in commands.

  All of these "[[https://git-scm.com/book/en/v2/Git-Basics-Getting-a-Git-Repository][basics]]" are covered in detail in the book Pro Git (available on line). 

* Using *Git* in Linux
  Try to note when I use the word "git" and when I use the word "github". They are different things. 
  
** Making your first repository (aka "repo") on your laptop.
   1. Open a terminal
   2. Move (~cd~ or ~dir~) into your Desktop
   3. type =git init myrepo=
   4. You should see message from the terminal prompt that it has been created.
   5. Feel free to delete (e.g. =rm -rf ./myrepo=)
** Cloning a Course Repo

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349595?h=4b78ed9d6a&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fc : Drawing to Understand Git and Github (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
#+end_export

On your laptop (Ybuntu):
   1. Move to a directory where you want to keep things organized. I use =~/gitRepos/=. To make that directory you could do ~mkdir ~/gitRepos/~ and then ~cd~ to it. Verify you are there with ~pwd~. All this is happening /in the terminal./
   2. Open a web browser and find *your fork* of Psych363. On that page there should be a button to clone it that will allow you to copy the command. It may be hidden. Look for a blue "code" button. Hitting that may open the dialogue that shows you the clone command.
   3. Go back to your terminal and paste it (usually =Ctrl-Shift v=). Hit <enter>.
   4. You should see some activity that things are being copied.
   5. =ls= to see you have a new directory in your =gitRepos= directory.
   6. =cd= into this new directory and look around. Compare it to what you see when you look at your fork on github. 
   For the assessment we will create more remotes and work on generating a pull request.

   #+begin_export html
   <div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349516?h=ed8c2e0af8&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fe : Github Pull Request Assessment (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
#+end_export

*** Magit
    1. Emacs provides you with an interface for this called magit.
    2. If you watched the [[https://vimeo.com/455628993#t=942s][emacs beginning video]] you will have seen the commands you need to add to your =init.el= file to get the =magit= package. If not, you can always take a look now.  
    3. You will probably have to quit and then restart Emacs for the magit package to be visible.
    4. Then you launch it by navigating (in Emacs) to the directory of your repository and typing: ~C-c m~ or ~M-x magit~ usually.
* Git Pull Request and Issues Assessment
** Task
  1. Generate a pull request for the [[https://github.com/brittAnderson/psych363Practice][psych363Practice]] repository on Github.
  2. Generate an issue for the psych363Practice repository. 

** Comment
  This course makes use of [[https://github.com][github]] for practicing how to use the version control program git. An important part of collaborating on code (or other material hosted on github, which might include text files) is to be able to give back or to alert the owner to a problem. This requires that you can both generate a *pull request* and that you can *open an issue.*

