book/version-control.html

<div id="outline-container-org0af0de5" class="outline-2">
<h2 id="org0af0de5"><span class="section-number-2">13.</span> Terms</h2>
<div class="outline-text-2" id="text-13">
<dl class="org-dl">
<dt>Fork</dt><dd>A copy of one github repository to another <b>github</b> repository.</dd>
<dt>Clone</dt><dd>A copy of one <b>git</b> repository to another <b>git</b> repository. 
The first repository might be hosted on github, but the second one, the <i>cloned</i> one exists on a local machine. In your case this is probably your laptop.</dd>
<dt>Remote</dt><dd>This is a repository that you are following. You will typically <i>pull</i> from these, but your <i>push</i> permissions may be limited depending on the distinctions between forks and clones, and whether you own the remote or someone else does. You can have more than one remote.</dd>
<dt>Pull</dt><dd>the transfer of information and changes <b>from</b> one repository incorporated into another. This is how you get the new information from a remote transported to a local repository that you control.</dd>
<dt>Push</dt><dd>this is the transfer of information <b>to</b> a repository you control (or have permissions to push to) from another repository that you control. This is often from your local laptop version to the hosted repository (your fork) on github.</dd>
<dt>Pull Request</dt><dd>When you have information or changes that you think would be helpful to a remote you do <b>not</b> have push permissions for then you can request that the owner of that repository pull in your changes. This is a formal process called a pull request. It is primarily a github concept and not a git concept.</dd>
<dt>Branch</dt><dd>within a repository the development of the code may be proceeding in a few different directions at the same time. The principal production branch is conventionally called <b>master</b>. And the principal repository that is the main, shared one is called <b>origin</b>. We will not be working with branches in our course, but those terms do show up in commands.</dd>
</dl>

<p>
All of these "<a href="https://git-scm.com/book/en/v2/Git-Basics-Getting-a-Git-Repository">basics</a>" are covered in detail in the book Pro Git (available on line). 
</p>
</div>
</div>

<div id="outline-container-org618cab4" class="outline-2">
<h2 id="org618cab4"><span class="section-number-2">14.</span> Using <b>Git</b> in Linux</h2>
<div class="outline-text-2" id="text-14">
<p>
Try to note when I use the word "git" and when I use the word "github". They are different things. 
</p>
</div>

<div id="outline-container-orgfd1fe6f" class="outline-3">
<h3 id="orgfd1fe6f"><span class="section-number-3">14.1.</span> Making your first repository (aka "repo") on your laptop.</h3>
<div class="outline-text-3" id="text-14-1">
<ol class="org-ol">
<li>Open a terminal</li>
<li>Move (<code>cd</code> or <code>dir</code>) into your Desktop</li>
<li>type <code>git init myrepo</code></li>
<li>You should see message from the terminal prompt that it has been created.</li>
<li>Feel free to delete (e.g. <code>rm -rf ./myrepo</code>)</li>
</ol>
</div>
</div>
<div id="outline-container-orgb0c6176" class="outline-3">
<h3 id="orgb0c6176"><span class="section-number-3">14.2.</span> Cloning a Course Repo</h3>
<div class="outline-text-3" id="text-14-2">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349595?h=4b78ed9d6a&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fc : Drawing to Understand Git and Github (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>

<p>
On your laptop (Ybuntu):
</p>
<ol class="org-ol">
<li>Move to a directory where you want to keep things organized. I use <code>~/gitRepos/</code>. To make that directory you could do <code>mkdir ~/gitRepos/</code> and then <code>cd</code> to it. Verify you are there with <code>pwd</code>. All this is happening <i>in the terminal.</i></li>
<li>Open a web browser and find <b>your fork</b> of Psych363. On that page there should be a button to clone it that will allow you to copy the command. It may be hidden. Look for a blue "code" button. Hitting that may open the dialogue that shows you the clone command.</li>
<li>Go back to your terminal and paste it (usually <code>Ctrl-Shift v</code>). Hit &lt;enter&gt;.</li>
<li>You should see some activity that things are being copied.</li>
<li><code>ls</code> to see you have a new directory in your <code>gitRepos</code> directory.</li>
<li><code>cd</code> into this new directory and look around. Compare it to what you see when you look at your fork on github.</li>
</ol>
<p>
For the assessment we will create more remotes and work on generating a pull request.
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/456349516?h=ed8c2e0af8&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen style="position:absolute;top:0;left:0;width:100%;height:100%;" title="Fe : Github Pull Request Assessment (i2c4p)"></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
</div>

<div id="outline-container-org693afa8" class="outline-4">
<h4 id="org693afa8"><span class="section-number-4">14.2.1.</span> Magit</h4>
<div class="outline-text-4" id="text-14-2-1">
<ol class="org-ol">
<li>Emacs provides you with an interface for this called magit.</li>
<li>If you watched the <a href="https://vimeo.com/455628993#t=942s">emacs beginning video</a> you will have seen the commands you need to add to your <code>init.el</code> file to get the <code>magit</code> package. If not, you can always take a look now.</li>
<li>You will probably have to quit and then restart Emacs for the magit package to be visible.</li>
<li>Then you launch it by navigating (in Emacs) to the directory of your repository and typing: <code>C-c m</code> or <code>M-x magit</code> usually.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb239b23" class="outline-2">
<h2 id="orgb239b23"><span class="section-number-2">15.</span> Git Pull Request and Issues Assessment</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgba59b45" class="outline-3">
<h3 id="orgba59b45"><span class="section-number-3">15.1.</span> Task</h3>
<div class="outline-text-3" id="text-15-1">
<ol class="org-ol">
<li>Generate a pull request for the <a href="https://github.com/brittAnderson/psych363Practice">psych363Practice</a> repository on Github.</li>
<li>Generate an issue for the psych363Practice repository.</li>
</ol>
</div>
</div>

<div id="outline-container-org0a56151" class="outline-3">
<h3 id="org0a56151"><span class="section-number-3">15.2.</span> Comment</h3>
<div class="outline-text-3" id="text-15-2">
<p>
This course makes use of <a href="https://github.com">github</a> for practicing how to use the version control program git. An important part of collaborating on code (or other material hosted on github, which might include text files) is to be able to give back or to alert the owner to a problem. This requires that you can both generate a <b>pull request</b> and that you can <b>open an issue.</b>
</p>
</div>
</div>
