book/version-control.html

<div id="outline-container-org8a3cb2d" class="outline-3">
<h3 id="org8a3cb2d"><span class="section-number-3">15.3.</span> Steps</h3>
<div class="outline-text-3" id="text-15-3">
<ol class="org-ol">
<li>Previously you should have <i>forked</i> the psych363Practice repository.</li>
<li>Next you will need to clone your fork to your laptop.</li>
<li>Check that you have your fork as a <i>remote.</i></li>
<li>Add <b>my original</b> version of the repository as a second remote.</li>
<li>To make sure you have the latest code, including all the other pulls generated by other students in the course you will want to:
<ol class="org-ol">
<li><i>Pull</i> from <b>my original</b> repo.</li>
<li>Accept and merge the changes if necessary.</li>
<li><i>Push</i> these new changes to <b>your fork</b> on github.</li>
<li>Verify the new changes made it there by looking at your fork in your browser. You may have to refresh your browser to see the changes.</li>
<li>Now, in the <code>gitnames</code> subdirectory add a file with &lt;yourfirstname&gt;.txt. Put some simple sentence in it.</li>
<li><b>Add</b> this file.</li>
<li><b>Commit</b> this change.</li>
<li><i>Push</i> to your fork.</li>
<li>In your web browser initiate a <b>pull request.</b></li>
</ol></li>
<li>When I receive your pull request I will accept it and give you half credit for this assignment (if you are a UWloo student).</li>
<li>Next, open an <i>issue.</i> Just give it a simple title and make a simple statement. Our goal is to practice the process. Note the number of your issue and upload this number to the dropbox with your github name so I can match issues and pull requests to students.</li>
</ol>

<p>
Important Note: To help each other learn how to use git, github, and
the material of this course, whether or not you are a UWaterloo
student, use the <a href="https://github.com/brittAnderson/Intro2Computing4Psychology/issues">issue function in the Intro2Computing4Psychology</a>
repository to report your problems and confusions. That issue record
will persist for future visitors to the repo who have the same
question see how we dealt with it.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-03 Fri 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-03 Fri 05:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>